---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.DirectShapeFailures
source: html/7ca7a908-daa0-c2e5-5f0b-022b1962e203.htm
---
# BuiltInFailures.DirectShapeFailures Properties

Cannot create a DirectShape or DirectShapeType.